Revit 2027 API
DuctFittingAndAccessoryPressureDropItem.BeginConnectorIndex Property
 The index of the begin connector of the flow path.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int BeginConnectorIndex { get; }
Public ReadOnly Property BeginConnectorIndex As Integer
	Get
public:
property int BeginConnectorIndex {
	int get ();
}
member BeginConnectorIndex : int with get
Property Value
Int32
See Also
Reference
DuctFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Mechanical Namespace